<a href="https://colab.research.google.com/github/JonathanKBP/Analise-de-jogadores-da-fifa-Data-Science/blob/main/Processando_os_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Conhecer os dados**

In [1]:
import pandas as pd

In [27]:
dados = pd.read_csv('sds_fifa.csv', index_col=[0])

In [28]:
dados

                 Nome  Idade Posicao  ...             Time  Salario Total_Pontos
0            V. Thill     20      RW  ...      CD Nacional      €2K         1551
1      S. Wamangituka     20      RM  ...    VfB Stuttgart     €13K         1847
2          14 A. Wolf     31      CB  ...        AS Monaco     €30K         1621
3       N. De la Cruz     23      CM  ...      River Plate     €17K         2180
4                Isco     28     CAM  ...      Real Madrid    €190K         2077
...               ...    ...     ...  ...              ...      ...          ...
2995        T. Souček     25     CDM  ...  West Ham United     €46K         2075
2996       Rúben Dias     23      CB  ...  Manchester City    €110K         1777
2997         P. Foden     20     CAM  ...  Manchester City     €95K         1997
2998     Nuno Tavares     20      LB  ...       SL Benfica      €7K         1900
2999         M. Kudus     19     CAM  ...             Ajax     €10K         2015

[3000 rows x 8 columns]

In [29]:
# Pegar o cabeçalho
dados.head()

              Nome  Idade Posicao  ...           Time  Salario Total_Pontos
0         V. Thill     20      RW  ...    CD Nacional      €2K         1551
1   S. Wamangituka     20      RM  ...  VfB Stuttgart     €13K         1847
2       14 A. Wolf     31      CB  ...      AS Monaco     €30K         1621
3    N. De la Cruz     23      CM  ...    River Plate     €17K         2180
4             Isco     28     CAM  ...    Real Madrid    €190K         2077

[5 rows x 8 columns]

In [11]:
# Pega os últimos dados
dados.tail()

                Nome  Idade Posicao  ...                 Time  Salaria Total_Pontos
2995   P. De la Vega     19      RW  ...  Club Atlético Lanús     €11K         1981
2996       T. Almada     19     CAM  ...      Vélez Sarsfield      €9K         2001
2997         D. Rice     21     CDM  ...      West Ham United     €31K         1823
2998        P. Foden     20     CAM  ...      Manchester City     €95K         1997
2999   D. Szoboszlai     19     CAM  ...           RB Leipzig     €27K         1967

[5 rows x 8 columns]

In [13]:
# Pegar amostra aleatória
dados.sample(12)

                   Nome  Idade  ... Salaria  Total_Pontos
2454      P. De la Vega     19  ...    €11K          1981
1074      P. De la Vega     19  ...    €11K          1981
382      R. Gravenberch     18  ...     €6K          2016
2158           P. Foden     20  ...    €95K          1997
1496          T. Almada     19  ...     €9K          2001
2886        Y. Bissouma     23  ...    €44K          2024
2559          Ansu Fati     17  ...    €24K          1817
8         10 M. Jackson     35  ...      €0          1023
2289          X. Simons     17  ...     €2K          1656
1501   A. Bella-Kotchap     18  ...     €2K          1439
763            F. Wirtz     17  ...     €7K          1876
444      Marcos Antonio     20  ...    €650          1851

[12 rows x 8 columns]

In [14]:
# Tirar as informações dos dados
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3000 entries, 0 to 2999
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nome          3000 non-null   object
 1   Idade         3000 non-null   int64
 2   Posicao       3000 non-null   object
 3   Media         3000 non-null   int64
 4   Potencial     3000 non-null   int64
 5   Time          2951 non-null   object
 6   Salaria       3000 non-null   object
 7   Total_Pontos  3000 non-null   int64
dtypes: int64(4), object(4)
memory usage: 210.9+ KB

In [15]:
# Tirar as inforções numéricas
dados.describe()

             Idade        Media    Potencial  Total_Pontos
count  3000.000000  3000.000000  3000.000000   3000.000000
mean     21.381333    76.036333    85.669000   1874.937333
std       4.511101     6.626637     5.167753    219.029170
min      16.000000    59.000000    67.000000    911.000000
25%      18.000000    72.000000    85.000000   1757.500000
50%      20.000000    76.000000    87.000000   1881.000000
75%      23.000000    80.000000    88.000000   2014.000000
max      35.000000    93.000000    95.000000   2336.000000

In [16]:
# Tirar as inforções numéricas invertendo linha por coluna
dados.describe().T

               count         mean         std  ...     50%     75%     max
Idade         3000.0    21.381333    4.511101  ...    20.0    23.0    35.0
Media         3000.0    76.036333    6.626637  ...    76.0    80.0    93.0
Potencial     3000.0    85.669000    5.167753  ...    87.0    88.0    95.0
Total_Pontos  3000.0  1874.937333  219.029170  ...  1881.0  2014.0  2336.0

[4 rows x 8 columns]

# **Traformar/Processar os nossos dados**

In [30]:
# Eliminando o € do salário
dados['Salario'] = dados['Salario'].str.replace('€', '')

In [31]:
dados

                 Nome  Idade Posicao  ...             Time  Salario Total_Pontos
0            V. Thill     20      RW  ...      CD Nacional       2K         1551
1      S. Wamangituka     20      RM  ...    VfB Stuttgart      13K         1847
2          14 A. Wolf     31      CB  ...        AS Monaco      30K         1621
3       N. De la Cruz     23      CM  ...      River Plate      17K         2180
4                Isco     28     CAM  ...      Real Madrid     190K         2077
...               ...    ...     ...  ...              ...      ...          ...
2995        T. Souček     25     CDM  ...  West Ham United      46K         2075
2996       Rúben Dias     23      CB  ...  Manchester City     110K         1777
2997         P. Foden     20     CAM  ...  Manchester City      95K         1997
2998     Nuno Tavares     20      LB  ...       SL Benfica       7K         1900
2999         M. Kudus     19     CAM  ...             Ajax      10K         2015

[3000 rows x 8 columns]

In [32]:
# Eliminar os dados vazios
dados = dados.dropna()

In [35]:
# Pegando dados únicos de salário
dados['Salario'].unique()

array(['2K', '13K', '30K', '17K', '190K', '82K', '5K', '20K', '6K', '10K',
       '290K', '1K', '44K', '25K', '40K', '14K', '67K', '48K', '3K',
       '16K', '500', '41K', '95K', '45K', '24K', '560K', '27K', '33K',
       '550', '50K', '7K', '9K', '22K', '70K', '11K', '220K', '19K',
       '46K', '110K', '135K', '170K', '160K', '270K', '77K', '150K',
       '58K', '76K', '240K', '210K', '78K', '4K', '53K', '29K', '23K',
       '61K', '38K', '59K', '66K', '90K', '83K', '31K', '36K', '125K',
       '71K', '8K'], dtype=object)

In [36]:
# Mostrando a quantidade de dados únicos em sálaro
dados['Salario'].nunique()

65

In [41]:
# Removendo o K e trocando por 000
dados['Salario'] = dados['Salario'].str.replace('K', '000')

In [42]:
dados

                 Nome  Idade Posicao  ...             Time  Salario Total_Pontos
0            V. Thill     20      RW  ...      CD Nacional     2000         1551
1      S. Wamangituka     20      RM  ...    VfB Stuttgart    13000         1847
2          14 A. Wolf     31      CB  ...        AS Monaco    30000         1621
3       N. De la Cruz     23      CM  ...      River Plate    17000         2180
4                Isco     28     CAM  ...      Real Madrid   190000         2077
...               ...    ...     ...  ...              ...      ...          ...
2995        T. Souček     25     CDM  ...  West Ham United    46000         2075
2996       Rúben Dias     23      CB  ...  Manchester City   110000         1777
2997         P. Foden     20     CAM  ...  Manchester City    95000         1997
2998     Nuno Tavares     20      LB  ...       SL Benfica     7000         1900
2999         M. Kudus     19     CAM  ...             Ajax    10000         2015

[3000 rows x 8 columns]

In [44]:
# Transformando a coluna salario em inteiro
dados['Salario'] = dados['Salario'].astype(str).astype(int)

In [52]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 120 entries, 0 to 119
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nome          120 non-null    object
 1   Idade         120 non-null    int64
 2   Posicao       120 non-null    object
 3   Media         120 non-null    int64
 4   Potencial     120 non-null    int64
 5   Time          120 non-null    object
 6   Salario       120 non-null    int64
 7   Total_Pontos  120 non-null    int64
dtypes: int64(5), object(3)
memory usage: 8.4+ KB

In [50]:
# Fizemos isso para conseguir análisar os salários
dados.describe().T

               count          mean           std  ...      50%      75%       max
Idade         3000.0     20.876000      4.418499  ...     20.0     22.0      35.0
Media         3000.0     75.566333      6.156317  ...     75.0     79.0      93.0
Potencial     3000.0     85.866333      3.824048  ...     87.0     88.0      95.0
Salario       3000.0  44421.150000  85285.790213  ...  17000.0  44000.0  560000.0
Total_Pontos  3000.0   1865.330333    212.553726  ...   1900.0   2014.0    2336.0

[5 rows x 8 columns]

In [51]:
# Apagar todos os dados repetidos
dados.drop_duplicates(inplace=True)

# **Responder algumas perguntas**

Quem é o jogador mais novo? E quem é o mais velho?

In [48]:
dados['Idade'].min()

16

In [53]:
dados[dados['Idade'] == 16]

          Nome  Idade Posicao  ...                Time  Salario Total_Pontos
11   R. Cherki     16      RW  ...  Olympique Lyonnais     6000         1623

[1 rows x 8 columns]

In [55]:
dados['Idade'].max()

35

In [56]:
dados[dados['Idade'] == 35]

                  Nome  Idade Posicao  ...      Time  Salario Total_Pontos
47   Cristiano Ronaldo     35      ST  ...  Juventus   220000         2221

[1 rows x 8 columns]

Qual o jogador tem mais pontos no ranking?

In [57]:
dados['Total_Pontos'].max()

2336

In [58]:
dados[dados['Total_Pontos'] == 2336]

                Nome  Idade Posicao  ...               Time  Salario Total_Pontos
73   Bruno Fernandes     25     CAM  ...  Manchester United   240000         2336

[1 rows x 8 columns]

In [60]:
dados[dados['Total_Pontos']==dados['Total_Pontos'].max()]['Nome']

73     Bruno Fernandes
Name: Nome, dtype: object

Qual posição mais comum dos jogadores nos nossos dados?

In [61]:
dados['Posicao'].value_counts()

ST     21
CAM    18
CB     17
RW     13
CM     10
RM     10
LW      8
RB      6
CDM     6
LM      5
LB      3
CF      1
RWB     1
GK      1
Name: Posicao, dtype: int64

Qual o time que mais aparece nos dados?

In [63]:
dados['Time'].value_counts().head()

FC Barcelona         10
Manchester United     7
Chelsea               6
FC Bayern München     5
Ajax                  5
Name: Time, dtype: int64

Qual a pontuação mais alta (coluna media)? E a mais baixa?

In [64]:
dados['Media'].max()

93

In [65]:
dados['Media'].min()

59

Quem tem o maior e menor salário?

In [66]:
dados['Salario'].max()

560000

In [68]:
dados['Salario'].min()

500

In [70]:
dados[dados['Salario'] == dados['Salario'].max()]['Nome']

32     L. Messi
Name: Nome, dtype: object

In [71]:
dados[dados['Salario'] == dados['Salario'].min()]['Nome']

25       J. Gvardiol
39         A. Hložek
54          R. Jones
62         C. Tzolis
110     B. Arrey-Mbi
Name: Nome, dtype: object

Qual o salário do jogador M. Ødegaard?

In [72]:
dados[dados['Nome'] == ' M. Ødegaard']['Salario']

61    135000
Name: Salario, dtype: int64

Quantos times únicos existem?

In [73]:
dados['Time'].nunique()

64

Quantos jogadores ganham mais de 100mil de salário?

In [106]:
salario_maior_que_100k = dados[dados['Salario'] >= 100000]

In [107]:
salario_maior_que_100k['Nome'].nunique()

17

Qual a média salarial dos 5 clubes mais comuns?

In [110]:
dados[dados['Time'] == 'FC Barcelona']['Salario'].mean()

134900.0

In [111]:
dados[dados['Time'] == 'Manchester United']['Salario'].mean()

83142.85714285714

In [112]:
dados[dados['Time'] == 'Chelsea']['Salario'].mean()

78333.33333333333

In [113]:
dados[dados['Time'] == 'FC Bayern München']['Salario'].mean()

94600.0

In [114]:
dados[dados['Time'] == 'Ajax']['Salario'].mean()

11800.0

In [116]:
dados.to_csv('sds.fifa_atualizado.csv')